
    const config = {
        allowOddsStyle: 2147483647,//全局的allowOddsStyle
        SN: {  //球类
            1: "soccer",
            2: "basketball",
            3: "football",
            4: "baseball",
            5: "hockey",
            6: "tennis",
            7: "volleyball",
            8: "handball",
            12: "volleyball"
        },
        MarketName: {//盘口类型
            1: "全场让球",
            2: "上半场让球",
            3: "全场大小",
            4: "上半场大小",
            5: "全场赛果",
            6: "上半场赛果",
            //7:"全场.单双",
            //8:"半场.单双",
            9: "全场波胆",
            10: "上半场波胆",
            11: "全场总进球数",
            12: "上半场总进球数",
            //13:"最先进球/最后进球",
            //14:"上半场 最先进球/最后进球",
            //15:"全场/半场",
            //16:"独赢",
            //17:"主队进球",
            //18:"客队进球",
            //19:"净胜球",
            //20:"主队零失球",
            //21:"客队零失球",
            //22:"主队零失球获胜",
            //23:"客队零失球获胜",
            //24:"都进球(二者均得分)",
            //25:"双重机会（双重彩）",
            //26: "三项让分投注",
            //27:"",
            //28:"",
            //29:"",
            //100:"优胜冠军",
            //101:"混合过关",
        },
        MarketEnum: {           //盘口类型
            F_HDP: 1,           //全场.让球
            H_HDP: 2,           //半场.让球
            F_OU: 3,            //全场.大小
            H_OU: 4,            //半场.大小
            F_1X2: 5,           //全场.1X2
            H_1X2: 6,           //半场.1X2
            F_OE: 7,            //全场.单双
            H_OE: 8,            //半场.单双
            F_CS: 9,            //全场.波胆(正确比分)
            H_CS: 10,           //半场.波胆
            F_TG: 11,           //全场.总进球
            H_TG: 12,           //半场.总进球
            F_FGLG: 13,         //最先进球/最后进球
            H_FGLG: 14,         //上半场 最先进球/最后进球
            FTHT: 15,           //全场/半场
            ML: 16,             //独赢
            Home_TG: 17,        //主队进球
            Away_TG: 18,        //客队进球
            WM: 19,             //净胜球
            Home_CleanSheet: 20,//主队零失球
            Away_CleanSheet: 21,//客队零失球
            Home_WinNil: 22,    //主队零失球获胜
            Away_WinNil: 23,    //客队零失球获胜
            BothGoal: 24,       //都进球(二者均得分)
            DC: 25,             //双重机会（双重彩）
            TWH: 26,            //三项让分投注
            Home_OU: 27,
            Away_OU: 28,
            HCS_FCS: 29,
            OR: 100,            //优胜冠军
            MIX: 101            //混合过关
        },
        BetEnum: { Narmal: 1, MixParlay: 2, OutRight: 3 },//投注类型 [普通、混合过关、优胜冠军]
        BetListEnum: { Waiting: 0, History: 1 },//
        RequestBetError: {
            Success: 0,//获取成功
            OddChange: 1,//赔率改变
            OutLeveChanged: 2,
            TicketError: 3,
            LimitError: 4,
            SystemError: 5,
            OverLimit: 6,
            MixParamNotFind: 7,
            NeedLogin: 8//未登陆
        },
        BetResultEnum: {//投注结果
            Done: 0,            //投注成功
            Fail: 1,            //投注失败 [此状态显示盘口已关闭]
            HdpChanged: 2,      //Hdp改变
            OddsChanged: 3,     //赔率改变
            LessMinLimit: 4,    //小于最小小额
            OverMaxlimit: 5,    //超出信用限额

            OutLevelChanged: 6, 	//ot改变
            InsuffBalance: 7,	//余额不足
            MixBetUnder: 8,		//mix数量不足
            MixBetOver: 9,		//mix数量超过
            QuotaLimit: 10,		//今日投注配额已使用完
            NeedLogin: 11,		//未登陆
            TooOften: 12			//投注过于平凡
        },
        BetStatusEnum: {        //注单状态枚举
            All: -3,
            BetFail: -1,
            Waiting: 0,
            Accepted: 1,
            Settle: 2,
            Cancel: 3,
            Reject: 4
        },
        MixMaxBet: 10,//混合过关最大投注数
        MpIDs: [149, 1, 4, 9, 16, 25, 43, 68, 104],
        //刷新时间
        RefreshTime: {
            GuessTime: 10000,//按时间
            GuessLeague: 10000,//按联赛
            GuessLive: 5000,//滚球
            GuessMix: 10000,//混合过关
            Match: 10000,//比赛
            LeagueLive: 10000,//即时
            LeagueResult: 10000,//赛果
            LeagueProcess: 10000//赛程
        },
        PublishMsg:{
			    "0": "系统错误",
				"1": "成功",
				"2": "账号已退出",
				"3": "会员不存在",
				"4": "未绑定三方平台",
				"5": "服务已关闭",
				"6": "Token签名错误",
				"7": "Token失效",
				"8": "服务器与服务器存在时差",
				"9": "签名错误",
				"10": "Token解析错误",
				"11": "Token与服务器存在时差",
				"12": "载荷参数错误",
				"13": "超过访问频率",
				"14": "Session超过访问频率",
				"15": "Token超过访问频率",
				"16": " IP超过访问频率" ,
				"17": " 未绑定手机号" ,
			
				"1001": "密码错误" ,
				"1002": "验证码错误" ,
				"1003": "账号已存在" ,
				"1004": "注册验证码失效",
				"1005": "邮箱已存在",
				"1006": "会员已存在",
				"1007": "OpenID已存在",
				"1008": "手机号已存在",
				"1008b": "手机号已绑定",
				"1008r": "手机号已注册",
				"1009": "验证码错误",
				"1010": "参数无效",
				"1011": "邮箱不存在",
				"1012": "手机号不存在",
				"1013": "相同的手机号",
				"1014": "相同的邮箱",
				"1015": "验证码次数超过限制",
				"1016": "请求次数太多，请稍后再试",
			
				"1101": "余额错误：无效参数" ,
				"1102": "余额错误：余额不足" ,
				"1103": "余额错误：会员不存在",
				"1104": "余额错误：余额日志存在" ,
				"1105": "余额错误：备注错误" ,
				"1106": "余额错误：流水号错误",
				"1107": "钻石余额不足",
			
				"1201": "参数错误,手机号码为空",
				"1202": "参数错误,验证码为空",
				"1203": "参数错误,账号为空",
				"1204": "参数错误,密码为空",
				"1205": "参数错误,Code和OpenID同时未空",
				"1206": "参数错误,手机号格式错误",
				"1207": "参数错误,Email格式错误",
				"1208": "参数错误,性别枚举参数超界",
				"1209": "参数错误,OpenID为空",
				"1210": "参数错误,OpenID错误",
				"1211": "参数错误,Email为空",
				"1212": "参数错误,昵称为空",
				"1213": "参数错误,Key为空",
			
			
				"2001": "奖品不存在" ,
				"2002": "奖品不足" ,
				"2003": "获取三方OpenID失败" ,
			
				"6001": "页码配置错误",
				"6002": "活动结束时间错误,时间为0 或者 结束时间小于当前时间",
				"6003": "活动名称为空",
				"6004": "最大人数错误",
				"6005": "活动不存在",
				"6006": "问题为空",
				"6007": "为题已存在",
				"6008": "问题不存在",
				"6009": "选项为空",
				"6010": "选项不存在",
				"6011": "选项已存在",
				"6012": "活动已结算",
				"6013": "活动ID为空",
				"6101": "投注答案为空",
				"6102": "已投注",
				"6103": "活动未结束",
				"6104": "已结算",
				"6105": "更改用户余额失败",
				"6106": "更新数据库失败",
				"6107": "写入MQ失败",
				"6108": "超过投注人数上限",
				"6109": "已投注人数错误",
				"6110": "活动已截止",
				"6111": "未选择所有问题答案",
				"6112": "活动已取消",
				"6113": "活动答案未录入完整",
			
				"7001": "发布者为空",
				"7002": "主题为空",
				"7003": "添加消息错误",
				"7004": "更新消息错误",
				"7005": "消息已被删除",
				"7006": "删除消息错误",
				"7007": "图片格式错误,只允许为jpg,png,jpeg图片",
				"7008": "图片超过限制",
				"7009": "消息不存在",
				"7010": "消息存储数据库失败",
				"7011": "消息ID为空",
				
				"8001": "发布记录不存在",
				"8002": "扣款服务失败",
				"8003": "购买方式错误",
				"8004": "每场比赛的类型只能发布一个注单，每一个注单为一个推荐",
				"8005": "该注单已发布",
				"8006": "投注猜豆必须 ≥1000",
				"8007": "赔率必须 ≥1.70",
				"8008": "已超过截止时间",
				"8009": "只能赛前",
				"8010": "只能是指定发布类型之一",
				"8011": "赛前全场胜负平和赛前全场让球盘只能任选其一",
				"8012": "注单不存在",
				"8013": "只能发布全场比赛",
				
				"9002":"解盘关闭",
				"9003":"解盘不存在",
				"9004":"比赛已经开始",
				"9005":"已经购买",
				"9006":"扣款失败",
				"9007":"送猜豆失败"

		},
        AgentKey:"qic"

    };

    export default config;

